project/models/ProjectTaouserQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `project_taouser` WHERE `user_id`=71