project/models/ProjectPasswordResetRequestForm.php

SELECT * FROM `project_user` WHERE (`status`=10) AND (`project_id`=1) AND (`email`='renowijoyo@gmail.com')
UPDATE `project_user` SET `password_reset_token`='wjcGNZC4DkY4MyLRPxW7WZ0ZXbVdw2NW_1603250802', `updated_at`=1603250802 WHERE `id`=29
---
    public function sendEmail()
    {
        /* @var $user User */
        $user = ProjectUser::findOne([
            'status' => ProjectUser::STATUS_ACTIVE,
            'project_id' => $this->project_id,
            'email' => $this->email,
        ]);

        if (!$user) {
            return false;
        }

        if (!ProjectUser::isPasswordResetTokenValid($user->password_reset_token)) {
            $user->generatePasswordResetToken();
            if (!$user->save()) {