project/models/ProjectSignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new ProjectUser();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->project_id = $this->project_id;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        return $user->save()
---
INSERT INTO `project_user` (`username`, `email`, `project_id`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('renowijoyo@gmail.com', 'renowijoyo@gmail.com', 1, '$2y$13$bH7w4Mn1XaUNfJSuFIwE/.L7Ds7mDXwhelGFrEXjEb3WaQP/OZDQu', 'bTev0j1fzgFfLyRN1VbdjrrFotc3iV8h', 'GSY6FLSuO34yUaCXIT3d3JPZy3tWo1M7_1603263509', 10, 1603263509, 1603263509)