project/models/ProjectGroupQuery.php

SELECT * FROM `project_group` WHERE `project_id`=4
---
    public function all($db = null)
    {
        return parent::all($db);