project/models/ProjectUser.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `project_user` WHERE (`id`=38) AND (`status`=10)

    public static function findByPasswordResetToken($token)
    {
        if (!static::isPasswordResetTokenValid($token)) {
            return null;
        }

        return static::findOne([
            'password_reset_token' => $token,
            'status' => self::STATUS_ACTIVE,
        ]);
---
SELECT * FROM `project_user` WHERE (`password_reset_token`='U4JDP6nk_N53LZdsB1hqmSo4AElvo94Y_1610783566') AND (`status`=10)