project/models/ProjectUserProfileQuery.php

SELECT * FROM `project_user_profile` WHERE `projectUserId`=72
---
    public function one($db = null)
    {
        return parent::one($db);