project/models/ProjectProfileDataQuery.php

SELECT * FROM `project_profile_data` WHERE (`profileId`=4) AND (`projectId`='1')
---
    public function one($db = null)
    {
        return parent::one($db);