project/models/TaoUserQuery.php

SELECT * FROM `taouser` WHERE `user_id`=29
---
    public function one($db = null)
    {
        return parent::one($db);