project/controllers/SiteController.php

SELECT * FROM `project_user` WHERE (`project_id`=1) AND (`username`='renowijoyo@gmail.com')
---
    public function preassignedGroups($username)
    {
        $userT = ProjectUser::find()->andWhere(['username' => $username])->One();

SELECT EXISTS(SELECT * FROM `profile` WHERE `profile`.`id`=4)
SELECT EXISTS(SELECT * FROM `project` WHERE `project`.`id`=1)
---
    public function actionProject($id)
    {

        $userid = Yii::$app->user->id;
        $profilemodel = ProjectUserProfile::find()->andWhere(['projectUserId' => $userid])->One();
        if (isset($profilemodel)) {
            echo 'isi';
            $profiledata = ProjectProfileData::find()->andWhere(['profileId' => $profilemodel->id])->andWhere(['projectId' => $id])->One();
            if (isset($profiledata)) {

            } else {
                $profiledata = new ProjectProfileData;
                $profiledata->projectId = $id;
                $profiledata->profileId = $profilemodel->id;
            }
        } else {

        }

        if ($profiledata->load(Yii::$app->request->post()) && $profiledata->save()) {