project/controllers/SiteController.php

    public function actionSignup()
    {

        $newUser = new TaoUser();

        if ($newUser->load(Yii::$app->request->post())
        ) {
            $taoUser = $this->createNewTaoUser($newUser);

            if ($taoUser->success)
            {
                $changename = $this->changeTaoLabel($newUser ,$taoUser->uri);

            $assigntogroup = $this->assignTaoUserToGroup($taoUser->uri, "https://cat.ppsdm.com/cat.rdf#i160325707133123994");

                $user = $this->createNewUser($newUser);
                //add tao user ID with project user id
                $projectnewuser = ProjectUser::find()->andWhere(['project_id' => $this->project_id])->andWhere(['username' => $newUser->username])->One();
                if ($user) {
                    $newUser->user_id = $projectnewuser->id;
                    $newUser->save();
---
UPDATE `taouser` SET `user_id`=32 WHERE `id`=18

                Yii::$app->session->setFlash('success', $taoUser->uri . 'exist');
            } else {
                $newUser->user_uri = $taoUser->uri;
                if($newUser->save()) {
---
INSERT INTO `taouser` (`first_name`, `last_name`, `user_uri`) VALUES ('andrea', 'wijoyo', 'https://cat.ppsdm.com/cat.rdf#i1603263508805223998')